{
  "main": {
    "name": "Thomas Karlsson",
    "occupation": " IT teacher",
    "description": " currently employed by ",
    "employer": "Turun ammatti-instituutti",
    "jobDescription": "teach students basic programming knowledge",
    "image": "profile_pic.jpg",
    "bio": "I am a Turku based IT-teacher at Turun ammatti-instituutti currently teaching basic programming to students aged 16 and up. My main passion is definitely front-end programming and I'm always eager to learn more and polish my skills. Videogames are my hobby and I try to stay physically active whenever I can or have time. I'm outgoing and always on the look for new opportunities.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "thomas.sanfrid.karlsson@gmail.com",
    "phone": "+358 40 1242237",
    "address": {
      "street": "Ruiskatu 8",
      "city": "Turku",
      "state": "Varsinais-Suomi",
      "zip": "20720"
    },
    "website": "http://www.tarlsson.com",
    "resumedownload": "https://drive.google.com/uc?export=pdf&id=1JZ_9_koC-W0jVg39lGh8Jd0hwJzv8kqn",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/thomas.karlsson.359/",
        "className": "fa fa-facebook"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/tarlsson/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/derollo",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I love to work on different projects when I have some sparetime outside work, here are some of my skills.",
    "education": [
      {
        "school": "Åbo Akademi",
        "degree": "Computer Science",
        "graduated": "ongoing",
        "description": "I started my studies at Åbo Akademi 2018 but due to my current economical situation I chose to work for a few years. I attended a few courses e.g. Python and Java."
      },
      {
        "school": "Åbo yrkesinstitut",
        "degree": "Datanom",
        "graduated": "April 2013",
        "description": "Åbo yrkesinstitut gave me hands on experiences with both hardware and software development. I completed my studies in 2 years thanks to my previous knowledge."
      }
    ],
    "work": [
      {
        "company": "Åbo yrkesinstitut",
        "title": "Teacher",
        "years": "August 2019 - Present",
        "description": "Working at Åbo yrkesinstitut has given me a lot of experience. I teach future software developers in various subjects such as programming, database management and how to work in teams with other people. The best thing about working at Åbo yrkesinsitut is to see students learn and experience an 'aha moment'."
      },
      {
        "company": "Archipelago Technics Oy",
        "title": "Store manager",
        "years": "November 2018 - June 2019",
        "description": "I worked for Archipelago Technics when the company opened a store in Turku. The company is based in Parainen and the owner decided to expand to the Turku region. I worked a lot on marketing and repaired and maintained customers' computers."
      }
    ],
    "skills": [
      {
        "name": "HTML5",
        "description": "Basic knowledge in HTML. My interest in webbdesign started of with basic HTML. My first experience with HTML was back in 2009.",
        "image": "html5.png"
      },
      {
        "name": "CSS",
        "description": "This kinda goes hand in hand with HTML, my first experience with styling HTML. Goes hand in hand with HTML experience.",
        "image": "css2.png"
      },
      {
        "name": "React Js",
        "description": "First experience with ReactJS was awesome, I never realised how easy it could be to design websites.",
        "image": "react.png"
      },
      {
        "name": "Python",
        "description": "Python was one of the first actuall languages that I worked with at school back in 2016. One of the easier languages that I've played around with.",
        "image": "python.png"
      },

      {
        "name": "",
        "description": "",
        "image": ""
      },
      {
        "name": "Lua",
        "description": "Lua was one of my main languages back in 2018. Me and a few friends had a gaming server and we worked with Lua.",
        "image": "lua.png"
      },
      {
        "name": "SQL",
        "description": "I learned SQL at the same time as I learned Lua for the game server, mentioned under Lua.",
        "image": "sql.jpg"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Thomas has helped me with my company website and always answers the phone when I have technical issues. He is a person you can trust and he works great with other people and thinks about what's best for his customers.",
        "user": "Camilla Hynynen - Creatella Photography"
      }
    ]
  }
}
